[
  {
    "chapter": "1. Introduzione",
    "topic": "Cos’è Blender",
    "content": "Blender è un software open source per la creazione di contenuti 3D. Supporta modellazione, sculpting, animazione, simulazioni, rendering, compositing, motion tracking e anche editing video. È usato in ambiti professionali e amatoriali per creare film, giochi, effetti visivi e arte 3D."
  },
  {
    "chapter": "1. Introduzione",
    "topic": "Interfaccia utente (viewport, header, sidebar)",
    "content": "L’interfaccia di Blender è composta da aree modulari. La viewport 3D consente di visualizzare e interagire con la scena, l’header contiene i menu contestuali e la sidebar offre pannelli laterali (attivabili con 'N') per proprietà e strumenti. Tutto è personalizzabile tramite layout."
  },
  {
    "chapter": "1. Introduzione",
    "topic": "Navigazione nello spazio 3D",
    "content": "La navigazione in Blender avviene tramite mouse e tastiera: rotazione con MMB, zoom con rotellina o Ctrl+MMB, pan con Shift+MMB. È possibile anche usare i tasti del tastierino numerico per viste predefinite (es. 1=fronte, 3=destra, 7=alto)."
  },
  {
    "chapter": "1. Introduzione",
    "topic": "Preferenze e personalizzazione",
    "content": "Le preferenze si trovano in Edit > Preferences. Da qui si possono gestire temi, input, add-on, sistema e viewport. Blender supporta scorciatoie personalizzate, salvataggio del layout e configurazioni multiple per diversi workflow."
  },
  {
    "chapter": "2. Modellazione",
    "topic": "Oggetti mesh, curve, testo, metaball",
    "content": "Blender supporta vari tipi di oggetti: mesh (geometria poligonale), curve (Bezier, NURBS), testo (convertibile in mesh), e metaball (forme fluide che si fondono tra loro). Ogni tipo ha proprietà e modalità di editing differenti."
  },
  {
    "chapter": "2. Modellazione",
    "topic": "Edit Mode",
    "content": "L'Edit Mode permette di modificare la geometria di un oggetto (solo mesh, curve, testo, ecc.). Si accede con Tab e consente la selezione e trasformazione di vertici, spigoli, facce. È distinta dall’Object Mode, che agisce sull’oggetto intero."
  },
  {
    "chapter": "2. Modellazione",
    "topic": "Strumenti di modellazione (estrusione, bevel, loop cut, knife, etc.)",
    "content": "Gli strumenti principali includono: Estrusione (E), Bevel (Ctrl+B), Loop Cut (Ctrl+R), Knife (K), Merge, Slide, Inset (I). Sono accessibili via shortcut o menu contestuali (tasto destro o 'Mesh' menu)."
  },
  {
    "chapter": "2. Modellazione",
    "topic": "Modificatori (Mirror, Subdivision Surface, Boolean, etc.)",
    "content": "I modificatori sono effetti non distruttivi applicati a oggetti. Mirror crea simmetria, Subdivision Surface ammorbidisce la mesh, Boolean consente operazioni logiche tra oggetti. Si trovano nel pannello dei modificatori (icona chiave inglese)."
  },
  {
    "chapter": "2. Modellazione",
    "topic": "Sculpting & Retopology",
    "content": "Lo sculpting consente di modellare mesh in modo organico con pennelli. La retopologia è il processo di creare una mesh pulita a partire da quella scolpita, per ottimizzarne la geometria. Blender include strumenti automatici e manuali per entrambi."
  },
  {
    "chapter": "3. Materiali e Shading",
    "topic": "Principled BSDF",
    "content": "Il nodo Principled BSDF è uno shader PBR (Physically-Based Rendering) che unifica numerose proprietà in un solo nodo. È basato sul modello di Disney e consente di simulare materiali realistici, da plastica a metallo, da pelle a vetro. Parametri chiave includono: Base Color (colore o texture principale), Roughness (rugosità), Metallic (riflessione metallica), Transmission (trasparenza), Subsurface (scattering), Specular / IOR (riflessione). È il nodo predefinito in Cycles ed Eevee per materiali fisicamente plausibili."
  },
  {
    "chapter": "3. Materiali e Shading",
    "topic": "Shader Node Editor",
    "content": "Lo Shader Node Editor permette di costruire materiali attraverso un sistema a nodi visivi. Si lavora collegando nodi di input (texture, coordinate), nodi di elaborazione (es. mix, math), e nodi di output (es. Material Output). È possibile combinare shader, sovrapporre texture e controllare dinamicamente le proprietà. È essenziale per creare materiali avanzati e dinamici."
  },
  {
    "chapter": "3. Materiali e Shading",
    "topic": "Materiali trasparenti e riflettenti",
    "content": "Per materiali trasparenti, usa Principled BSDF con Transmission = 1.0, Roughness per regolare l'opacità, e abilita Screen Space Refraction nei settings. In Eevee, attiva Refraction e Blend Mode: Alpha Hashed. Per materiali riflettenti, imposta Metallic = 1.0 e Roughness = 0.0 per un effetto specchio. Le riflessioni sono influenzate da HDRI o luci nella scena."
  },
  {
    "chapter": "3. Materiali e Shading",
    "topic": "Texture mapping",
    "content": "Il texture mapping consente di applicare immagini su superfici 3D. Usa Image Texture + Principled BSDF per collegare l'immagine. Puoi mappare usando UV Map (da UV Editing) o coordinate automatiche (Generated, Object, ecc.) tramite Texture Coordinate + Mapping. È fondamentale per aggiungere dettagli come colori, pattern o rilievi."
  },
  {
    "chapter": "3. Materiali e Shading",
    "topic": "Bump e Normal map",
    "content": "Le Bump e Normal Map simulano rilievi superficiali. Le Bump Map usano immagini in scala di grigi collegate tramite il nodo Bump. Le Normal Map usano immagini RGB (in genere viola) collegate tramite il nodo Normal Map. Entrambe si collegano all’input Normal del Principled BSDF e migliorano il dettaglio visivo senza aumentare la geometria."
  },
  {
    "chapter": "4. Luci e Rendering",
    "topic": "Tipi di luci (Point, Sun, Area, Spot)",
    "content": "Blender offre diversi tipi di luce: Point (una sorgente puntiforme in tutte le direzioni), Sun (luce direzionale con ombre parallele, ideale per esterni), Area (luce rettangolare o quadrata per effetti morbidi), Spot (luce a cono con controllo di angolo e attenuazione). Ogni luce ha parametri come intensità, colore, distanza e ombre configurabili."
  },
  {
    "chapter": "4. Luci e Rendering",
    "topic": "Cycles vs Eevee",
    "content": "Cycles è un motore di rendering path-tracing realistico che simula accuratamente la luce e le ombre, ma è più lento. Eevee è un renderer in tempo reale basato su rasterizzazione, molto veloce ma meno accurato. Cycles è preferito per qualità finale, Eevee per preview rapide e animazioni leggere."
  },
  {
    "chapter": "4. Luci e Rendering",
    "topic": "Impostazioni render (sample, denoise, ambient occlusion)",
    "content": "Le impostazioni di rendering includono: Samples (numero di raggi tracciati per pixel, maggiore = migliore qualità), Denoise (riduce il rumore, disponibile sia per viewport che render finale), e Ambient Occlusion (accentua le ombre nei punti di contatto per maggior profondità visiva). Sono accessibili nel pannello Render Properties."
  },
  {
    "chapter": "4. Luci e Rendering",
    "topic": "Motion Blur e Depth of Field",
    "content": "Motion Blur simula l'effetto di sfocatura in movimento, utile per animazioni fluide; si attiva nel pannello Render > Motion Blur. Depth of Field sfoca gli oggetti lontani dal piano focale della camera. Si abilita nelle impostazioni della camera, regolando distanza e apertura dell'obiettivo."
  },
  {
    "chapter": "4. Luci e Rendering",
    "topic": "Trasparenza e background",
    "content": "Per rendere il background trasparente in rendering (es. per esportare in PNG), abilita 'Film > Transparent' nelle impostazioni di render. Nei materiali, la trasparenza si controlla con nodi (Transmission o Alpha) e Blend Mode nel pannello Material Settings. In Eevee, usa Alpha Blend o Alpha Hashed per vedere la trasparenza correttamente."
  },
    {
    "chapter": "5. Camera e Viewport",
    "topic": "Camera tracking",
    "content": "Il camera tracking consente di integrare oggetti 3D in filmati reali. Blender supporta il tracking sia della camera che di oggetti specifici. Si importa il video nella sezione Movie Clip Editor, si definiscono i marker e si avvia il tracking. Poi si ricostruisce il movimento 3D con 'Solve Camera Motion'. È utilizzato in VFX per matchare virtuale e reale."
  },
  {
    "chapter": "5. Camera e Viewport",
    "topic": "Composizione",
    "content": "La composizione in Blender riguarda la disposizione visiva degli elementi nella scena, e viene supportata anche dal Compositor, dove si combinano e modificano output di rendering tramite nodi (es. Blur, Mix, Alpha Over). A livello visivo, si usano regole come la regola dei terzi, linee guida e il posizionamento strategico della camera per migliorare la resa visiva."
  },
  {
    "chapter": "5. Camera e Viewport",
    "topic": "Safe areas e focal length",
    "content": "Le safe areas sono guide visive in camera view per assicurare che gli elementi importanti (testi, oggetti) non escano dai margini nei diversi formati di output. Si attivano nel pannello View > Safe Areas. Il focal length (lunghezza focale) controlla il campo visivo della camera: valori bassi danno effetto grandangolo, alti effetto teleobiettivo."
  },
    {
    "chapter": "6. Animazione",
    "topic": "Keyframes",
    "content": "I keyframe definiscono i valori di una proprietà in un determinato istante temporale. Blender li usa per animare posizione, rotazione, scala, materiali, visibilità e altro. Si inseriscono premendo 'I' nel 3D View o nelle proprietà, e si visualizzano nella Timeline. L’interpolazione tra keyframe crea l’animazione."
  },
  {
    "chapter": "6. Animazione",
    "topic": "Timeline e Dope Sheet",
    "content": "La Timeline mostra i keyframe nel tempo e consente di spostarli, cancellarli o duplicarli. Il Dope Sheet offre una vista più organizzata e gerarchica di tutti i keyframe presenti in una scena, utile per animazioni complesse. Entrambi permettono di sincronizzare movimenti, audio ed effetti."
  },
  {
    "chapter": "6. Animazione",
    "topic": "Graph Editor (F-Curves)",
    "content": "Il Graph Editor visualizza le F-Curves (curve di interpolazione) dei keyframe. Permette di modificare i valori nel tempo con estrema precisione, controllando l’interpolazione (linear, constant, bezier) e regolando tangenti, overshoot, velocità. È indispensabile per animazioni fluide e dettagliate."
  },
  {
    "chapter": "6. Animazione",
    "topic": "Constraints e Driver",
    "content": "I Constraints impongono regole di movimento tra oggetti (es. 'Copy Location', 'Track To'). I Drivers controllano una proprietà usando un’espressione matematica o un’altra proprietà (es. rotazione = sin(frame)). Si usano per animazioni automatiche e sistemi complessi (es. rigging)."
  },
  {
    "chapter": "6. Animazione",
    "topic": "Shape Keys",
    "content": "Le Shape Keys definiscono variazioni di forma su un oggetto mesh. Vengono usate per espressioni facciali, morphing, deformazioni locali. Ogni shape key rappresenta una modifica, che può essere animata nel tempo. Si trovano nel pannello Object Data Properties > Shape Keys."
  },
  {
    "chapter": "6. Animazione",
    "topic": "NLA Editor",
    "content": "Il Non-Linear Animation Editor consente di combinare e gestire più azioni animate come se fossero clip video. Puoi creare cicli, sequenze, variazioni di velocità. È utile per riutilizzare animazioni (es. camminata, salti) in contesti diversi senza ricreare keyframe da zero."
  },
    {
    "chapter": "7. Audio & Video Editing",
    "topic": "Video Sequencer Editor (VSE)",
    "content": "Il Video Sequencer Editor (VSE) è il modulo di Blender dedicato al montaggio video. Permette di importare clip video, immagini, audio, effetti, e organizzarli su una timeline multi-traccia. Supporta il taglio, la sovrapposizione, il mixaggio e il rendering diretto del risultato finale. È utile per realizzare video completi senza uscire da Blender."
  },
  {
    "chapter": "7. Audio & Video Editing",
    "topic": "Inserimento audio",
    "content": "Per aggiungere audio nel VSE si usa 'Add > Sound'. Blender supporta formati come WAV e MP3. L’audio può essere sincronizzato alla timeline, visualizzato come forma d’onda e regolato in volume. Può essere usato sia come sottofondo musicale sia come traccia parlata o effetti sonori."
  },
  {
    "chapter": "7. Audio & Video Editing",
    "topic": "Transizioni video",
    "content": "Nel VSE si possono creare transizioni fluide tra due clip sovrapposte usando 'Add > Effect Strip > Cross', 'Gamma Cross', 'Wipe', ecc. Le transizioni controllano la dissolvenza visiva e possono essere modificate in durata e tipo. Sono essenziali per rendere il montaggio più professionale."
  },
  {
    "chapter": "7. Audio & Video Editing",
    "topic": "Proxy e cache",
    "content": "I proxy sono versioni a bassa risoluzione delle clip video che permettono un'anteprima più fluida durante il montaggio. Si abilitano nella sezione Strip > Proxy/Timecode. La cache (RAM o disco) memorizza fotogrammi renderizzati per migliorare la velocità di preview. Entrambe le opzioni ottimizzano le performance in progetti pesanti."
  },
    {
    "chapter": "8. Strumenti di Scripting",
    "topic": "Console Python integrata",
    "content": "Blender include una console Python interattiva accessibile da Scripting > Python Console. Consente di esplorare e modificare la scena in tempo reale, testare comandi e interagire con l’API `bpy`. È utile per debugging, prototipazione di strumenti e automazione veloce."
  },
  {
    "chapter": "8. Strumenti di Scripting",
    "topic": "`bpy` API",
    "content": "`bpy` è il modulo Python che fornisce accesso all’intera struttura interna di Blender. Permette di creare oggetti, modificare mesh, gestire materiali, animazioni, UI e molto altro. È organizzata in sotto-moduli (es. `bpy.data`, `bpy.ops`, `bpy.types`) e richiede familiarità con la struttura dati di Blender."
  },
  {
    "chapter": "8. Strumenti di Scripting",
    "topic": "Creazione di Add-on",
    "content": "Un add-on in Blender è uno script Python con struttura specifica (`bl_info`, `register`, `unregister`) che estende le funzionalità del programma. Può aggiungere operatori, pannelli, menu personalizzati. Gli add-on si salvano come file `.py` e si installano da Edit > Preferences > Add-ons > Install."
  },
  {
    "chapter": "8. Strumenti di Scripting",
    "topic": "Automazione di operazioni (operatori, registri, pannelli)",
    "content": "L’automazione avviene tramite la definizione di operatori personalizzati (`bpy.types.Operator`), pannelli UI (`bpy.types.Panel`) e registrazione con `bpy.utils.register_class`. Questi strumenti permettono di creare flussi di lavoro su misura, comandi custom e interfacce integrate per specifiche operazioni."
  },
    {
    "chapter": "9. Import/Export & File",
    "topic": "Formati supportati (FBX, OBJ, STL, GLTF, etc.)",
    "content": "Blender supporta numerosi formati di scambio: FBX (animazioni, rig, mesh), OBJ (mesh statiche), STL (stampa 3D), GLTF/GLB (web, VR/AR), Alembic (animazioni cache), Collada, SVG, USD, ecc. I formati si selezionano dal menu File > Import/Export e spesso offrono impostazioni specifiche per scala, materiali, animazioni."
  },
  {
    "chapter": "9. Import/Export & File",
    "topic": "Salvataggio & versioning",
    "content": "I file .blend contengono l’intera scena Blender. È possibile salvare versioni incrementali tramite File > Save As > +Number, oppure usare 'Auto Save' e 'Backup' dalle Preferenze. Blender consente anche il salvataggio compressi (.blend1, .blend2) per il versioning automatico."
  },
  {
    "chapter": "9. Import/Export & File",
    "topic": "Link/Append tra .blend",
    "content": "Con Append si importa una copia locale di dati da un altro file .blend (mesh, materiali, oggetti, azioni). Con Link si mantiene un collegamento dinamico ai dati esterni: modifiche nel file originale si riflettono automaticamente. Append = copia indipendente, Link = riferimento condiviso. Utile per progetti modulari."
  },
    {
    "chapter": "10. Grease Pencil",
    "topic": "Disegno 2D in 3D",
    "content": "Grease Pencil è uno strumento unico di Blender che permette di disegnare e animare in 2D all'interno di uno spazio 3D. Le linee sono oggetti vettoriali che possono esistere nella scena 3D, seguire la prospettiva e interagire con altri oggetti. È usato per storyboard, animazione tradizionale, annotazioni e illustrazione ibrida 2D/3D."
  },
  {
    "chapter": "10. Grease Pencil",
    "topic": "Strumenti, Layers, Animazione",
    "content": "Gli strumenti principali includono Pen, Fill, Eraser, Cutter e Sculpt. I layers funzionano come in software di grafica: gestiscono opacità, blending, ordine di disegno. L’animazione avviene tramite keyframe sui tratti disegnati, con onion skin per il supporto al disegno frame-by-frame. Può essere combinato con effetti, modificatori e rendering."
  },
    {
    "chapter": "11. Add-ons",
    "topic": "Installazione e gestione",
    "content": "Gli add-on sono estensioni Python che ampliano le funzionalità di Blender. Si gestiscono da Edit > Preferences > Add-ons. È possibile attivare/disattivare add-on preinstallati o installarne di nuovi tramite file `.py` o `.zip`. Gli add-on attivi vengono caricati all'avvio di Blender e possono aggiungere pannelli, operatori, menu personalizzati."
  },
  {
    "chapter": "11. Add-ons",
    "topic": "Add-on ufficiali vs personalizzati",
    "content": "Gli add-on ufficiali sono sviluppati e mantenuti dal team di Blender o da collaboratori fidati e sono inclusi nella distribuzione base. Gli add-on personalizzati sono creati da utenti o terze parti e possono essere scaricati da GitHub, Blender Market, ecc. Entrambi si installano nello stesso modo, ma quelli personalizzati richiedono verifica di compatibilità e sicurezza."
  },
  {
    "chapter": "11. Add-ons",
    "topic": "Add-on utili per UV, modellazione, VR",
    "content": "Tra gli add-on più utili: 'UV Packmaster' e 'Textools' per l’UV mapping, 'LoopTools' e 'Mesh Machine' per modellazione avanzata, 'VR Scene Inspection' per esplorare la scena in realtà virtuale. Molti add-on gratuiti sono inclusi in Blender e basta attivarli, mentre altri avanzati si trovano su marketplace esterni."
  },
    {
    "chapter": "12. UV Editing & Texture Painting",
    "topic": "UV Unwrap",
    "content": "Il UV Unwrap è il processo di appiattimento della superficie 3D di un oggetto per associarla a una texture 2D. In Blender, si esegue in Edit Mode con il comando 'U > Unwrap'. Il risultato è una mappa UV che definisce come le texture verranno applicate sull'oggetto. Esistono diversi metodi: Unwrap, Smart UV Project, Lightmap, ecc."
  },
  {
    "chapter": "12. UV Editing & Texture Painting",
    "topic": "Seams",
    "content": "I Seams sono le 'cuciture' che indicano a Blender dove tagliare la mesh durante l'Unwrap. Si marcano in Edit Mode con 'Mark Seam'. Una buona disposizione dei seams è fondamentale per evitare distorsioni e ottenere una mappa UV pulita. Si usano spesso in corrispondenza di bordi nascosti o naturali."
  },
  {
    "chapter": "12. UV Editing & Texture Painting",
    "topic": "Painting direttamente sull’oggetto",
    "content": "Blender consente di dipingere direttamente sulle mesh 3D tramite Texture Paint. È possibile modificare il colore diffuso, le mappe normal, specular, roughness, ecc. Lo strumento supporta pennelli personalizzati, livelli di texture, simmetria e maschere. È utile per dettagli artistici e texture hand-painted."
  },
  {
  "chapter": "Extra: Scene & World",
  "topic": "World Shader e Illuminazione ambientale",
  "content": "Il World Shader controlla il colore e la luce ambientale della scena. Si accede dal pannello World Properties e può essere personalizzato con nodi (es. Background + Environment Texture per HDRI). Influisce sull’illuminazione globale, soprattutto in Cycles."
  },
    {
    "chapter": "Use Cases",
    "topic": "Come creare un materiale vetro trasparente",
    "content": "Usa lo shader Principled BSDF con Transmission impostato a 1.0 e Roughness basso per un vetro liscio. Attiva 'Screen Space Refraction' nelle impostazioni del materiale. In Eevee, imposta Blend Mode su 'Alpha Hashed' o 'Alpha Blend' e attiva 'Refraction'. Aggiungi eventualmente una Normal Map per maggior realismo."
  },
  {
    "chapter": "Use Cases",
    "topic": "Come esportare un modello in formato glTF",
    "content": "Vai su File > Export > glTF 2.0 (.glb/.gltf). Scegli se esportare in formato binario (.glb) o JSON+bin (.gltf). Attiva 'Selected Objects' se vuoi esportare solo quelli selezionati. Assicurati che le texture siano collegate correttamente al Principled BSDF. È ideale per web e VR."
  },
  {
    "chapter": "Use Cases",
    "topic": "Come realizzare un loop animato (es. rotazione infinita)",
    "content": "Aggiungi un keyframe per la rotazione all'inizio e un altro a fine timeline (es. frame 1: 0°, frame 250: 360°). Nella Graph Editor, seleziona la curva e applica il modificatore 'Cycles' per ripetere l'animazione all’infinito. Imposta l’output su un numero di frame multiplo del loop per seamless playback."
  },
  {
    "chapter": "Use Cases",
    "topic": "Come usare Grease Pencil per animare una linea",
    "content": "Crea un oggetto Grease Pencil, passa in Draw Mode e disegna la linea. Attiva Onion Skin nel pannello Object Data Properties. Aggiungi keyframe disegnando su fotogrammi diversi. Passa a Animation o Dope Sheet per gestire la sequenza. Il tratto può essere modificato con i pennelli di Sculpt."
  },
  {
    "chapter": "Use Cases",
    "topic": "Come usare un add-on come LoopTools per uniformare vertici",
    "content": "Attiva LoopTools da Edit > Preferences > Add-ons. Entra in Edit Mode, seleziona i vertici da uniformare, premi W (o tasto destro) e scegli 'LoopTools > Relax' o 'Circle' per allineamento regolare. È utile per ripulire geometrie organiche o migliorare la topologia."
  },
  {
  "chapter": "Use Cases",
  "topic": "Come applicare una texture a un oggetto",
  "content": "Seleziona l’oggetto, vai nel tab Material Properties e crea un nuovo materiale. Aggiungi un nodo Image Texture nello Shader Editor, carica un file immagine e collegalo al nodo Principled BSDF (input Base Color). Assicurati che l’oggetto sia unwrapped. Passa in modalità Material Preview o Render per vedere il risultato."
  },
  {
  "chapter": "Use Cases",
  "topic": "Come usare un HDRI per illuminare la scena",
  "content": "Vai nel pannello World Properties > Color > clicca sul cerchio > Environment Texture. Carica un file HDRI. Se usi Cycles, l’effetto sarà visibile in Rendered View. Puoi anche regolare la rotazione con un nodo Mapping collegato al nodo Texture Coordinate nel Shader Editor."
  },
  {
  "chapter": "Use Cases",
  "topic": "Come dipingere una texture direttamente sull’oggetto",
  "content": "Entra in Texture Paint Mode. Crea un nuovo Image Texture (es. 2048x2048). Assegna la texture a un materiale e collega il nodo Image Texture al Principled BSDF. Dipingi direttamente sull’oggetto. Salva l’immagine al termine (Image > Save As) per evitare la perdita dei dati."
  }
]